app/Controllers/LoginController.php

    public function index()
    {

        $session = \Config\Services::session();
        $userModel = new UserModel();

        $email = $this->request->getVar('email');
        $password= $this->request->getVar('password');

        // $email = $_POST[
        // return $this->respond([
        //     'email' => $email,
        //     'password' => $password
        // ], 200);

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'SDFGSDFG'
 LIMIT 1