app/Controllers/ProductController.php

    public function index()
    {
        $product_obj = new ProductModel();

		// Select all products from table
        $products = $product_obj->findAll();
---
SELECT *
FROM `products`

    public function insertProduct()
    {
		$product_obj = new ProductModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'description' => $this->request->getVar('description'),
            'cost' => $this->request->getVar('cost'),
            'product_image' => $this->request->getVar('product_image'),
        ];
        $product = $product_obj->insert($data);
---
INSERT INTO `products` (`name`, `description`, `cost`, `product_image`) VALUES ('Laborum mollitia.', 'Molestiae officiis et quis quisquam ex tenetur voluptatibus at corporis voluptate.', '195', 'https://via.placeholder.com/100x100.png/0044aa?text=non')

	public function updateProduct($id){
		$product_obj = new ProductModel();
        $product = $product_obj->findProductById($id);


		// Update product information by product id
		$product_obj->update($id, [
			"name" => $this->request->getVar('name'),
			"description" => $this->request->getVar('description'),
			"cost" => $this->request->getVar('cost'),
			"product_image" => $this->request->getVar('product_image')
		]);
---
UPDATE `products` SET `name` = NULL, `description` = NULL, `cost` = NULL, `product_image` = NULL
WHERE `products`.`id` IN ('10')