app/Controllers/ProductController.php

DELETE FROM `products`
WHERE `id` IN ('2')
---
	public function deleteProduct(){
		$product_obj = new ProductModel();
		$product_id = 5; // ID to delete
		// Delete product by ID
		$product_obj->delete($product_id);